tests/Fixtures/Ergo/plan_search_expected.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.erv.de/eSoap/2019/09" xmlns:com="http://www.erv.de/eSoap/2019/09/common"><soapenv:Header/><soapenv:Body><ns:ERV_InsurancePlanSearchRQ MsgId="178c1149-96ef-4ef2-9d8d-b446be426e4d" EchoToken="178c1149-96ef-4ef2-9d8d-b446be426e4d" TransactionContext="0d211940-a70f-4c6c-83a3-a7d2a51be311" TimeStamp="2026-04-09T13:26:28+00:00" Target="T" AutoQuote="true" ListType="DE_STANDARD"><ns:Requestor><com:CRS>ESC_DE</com:CRS><com:CRSAgency>033315000000</com:CRSAgency><com:Initiator>customer</com:Initiator><com:Agent>customer</com:Agent><com:Localisation><com:Country>DE</com:Country><com:Language>de</com:Language><com:Currency>EUR</com:Currency></com:Localisation></ns:Requestor><ns:CoveredTrip><com:StartDate>2026-07-23</com:StartDate><com:EndDate>2026-07-27</com:EndDate><com:Destination><com:Country>NL</com:Country></com:Destination><com:BookingConfirmation>2026-04-09</com:BookingConfirmation><com:TotalTripCost Amount="6950" CurrencyCode="EUR"/></ns:CoveredTrip><ns:Travelers><com:Traveler ID="1"><com:Birthdate>1999-12-11</com:Birthdate></com:Traveler></ns:Travelers><ns:InsuranceCustomer><com:ResidenceCountryCode>DE</com:ResidenceCountryCode></ns:InsuranceCustomer></ns:ERV_InsurancePlanSearchRQ></soapenv:Body></soapenv:Envelope>
